
def area(a):
    '''Принимает число a (сторона квадрата) и возвращает площадь квадрата по формуле S = a^2
    
    Параметры:
            a (int): десятичное целое число

        Возвращаемое значение:
            area_result (int) : целое число a во второй степени
    '''
    area_result = a * a
    return area_result


def perimeter(a):
    '''Принимает число a (сторона квадрата) и возвращает периметр квадрата по формуле P = 4a
    
    Параметры:
            a (int): десятичное целое число

        Возвращаемое значение:
            perimeter_result (int) : целое число a, умноженное на 4
    '''
    perimeter_result = 4 * a
    return perimeter_result
